brambling/tests/functional/fixtures/stripe_webhook_charge_id_not_found.yaml

interactions:
- request:
    body: null
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Authorization: [Bearer sk_test_OBAqgCaFyOUaaFwHJirSbg9D]
      Connection: [keep-alive]
      Stripe-Version: ['2016-03-07']
      User-Agent: [Stripe/v1 PythonBindings/1.35.0]
      X-Stripe-Client-User-Agent: ['{"lang": "python", "publisher": "stripe", "httplib":
          "requests", "uname": "Linux brux 4.4.0-24-generic #43-Ubuntu SMP Wed Jun
          8 19:27:37 UTC 2016 x86_64 x86_64", "lang_version": "2.7.10", "platform":
          "Linux-4.4.0-24-generic-x86_64-with-Ubuntu-16.04-xenial", "bindings_version":
          "1.35.0"}']
    method: GET
    uri: https://api.stripe.com/v1/refunds/re_18EgsB2dPuL5A6ooGEq33q9o?expand%5B%5D=balance_transaction
  response:
    body: {string: !!python/unicode "{\n  \"id\": \"re_18EgsB2dPuL5A6ooGEq33q9o\"\
        ,\n  \"object\": \"refund\",\n  \"amount\": 6000,\n  \"balance_transaction\"\
        : {\n    \"id\": \"txn_18EgsB2dPuL5A6oozQ0nLPkz\",\n    \"object\": \"balance_transaction\"\
        ,\n    \"amount\": -6000,\n    \"available_on\": 1464101467,\n    \"created\"\
        : 1464101467,\n    \"currency\": \"usd\",\n    \"description\": \"REFUND FOR\
        \ CHARGE\",\n    \"fee\": -174,\n    \"fee_details\": [\n      {\n       \
        \ \"amount\": -174,\n        \"application\": null,\n        \"currency\"\
        : \"usd\",\n        \"description\": \"Stripe processing fee refund\",\n \
        \       \"type\": \"stripe_fee\"\n      }\n    ],\n    \"net\": -5826,\n \
        \   \"source\": \"re_18EgsB2dPuL5A6ooGEq33q9o\",\n    \"sourced_transfers\"\
        : {\n      \"object\": \"list\",\n      \"data\": [],\n      \"has_more\"\
        : false,\n      \"total_count\": 0,\n      \"url\": \"/v1/transfers?source_transaction=re_18EgsB2dPuL5A6ooGEq33q9o\"\
        \n    },\n    \"status\": \"available\",\n    \"type\": \"refund\"\n  },\n\
        \  \"charge\": \"ch_18C9kF2dPuL5A6ooUE5opsBX\",\n  \"created\": 1464101467,\n\
        \  \"currency\": \"usd\",\n  \"metadata\": {\n    \"order\": \"7pMR6czT\"\
        ,\n    \"event\": \"Demo Event\"\n  },\n  \"reason\": null,\n  \"receipt_number\"\
        : null,\n  \"status\": \"succeeded\"\n}\n"}
    headers:
      access-control-allow-credentials: ['true']
      access-control-allow-methods: ['GET, POST, HEAD, OPTIONS, DELETE']
      access-control-allow-origin: ['*']
      access-control-max-age: ['300']
      cache-control: ['no-cache, no-store']
      connection: [keep-alive]
      content-length: ['1103']
      content-type: [application/json]
      date: ['Thu, 23 Jun 2016 21:10:09 GMT']
      request-id: [req_8h3BO219GKKkwD]
      server: [nginx]
      strict-transport-security: [max-age=31556926; includeSubDomains]
      stripe-version: ['2016-03-07']
    status: {code: 200, message: OK}
version: 1
